lambda/src/test/resources/Membership2023/Batch1/AUD/subscription.json

{
  "success" : true,
  "id" : "8a1293d48440f69b01845b0d1c5d2099",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "ACCOUNT-NUMBER",
  "accountName" : "ACCOUNT-NAME",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName" : "ACCOUNT-NAME",
  "subscriptionNumber" : "SUBSCRIPTION-NAME",
  "version" : 7,
  "revision" : "7.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2016-11-09",
  "serviceActivationDate" : "2016-11-09",
  "customerAcceptanceDate" : "2016-11-09",
  "subscriptionStartDate" : "2016-11-09",
  "subscriptionEndDate" : "2023-11-09",
  "lastBookingDate" : "2022-11-09",
  "termStartDate" : "2022-11-09",
  "termEndDate" : "2023-11-09",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 10.00,
  "totalContractedValue" : 840.00,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : null,
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : null,
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : null,
  "ActivationDate__c" : null,
  "UserCancellationReason__c" : null,
  "CorporateAccountId__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : null,
  "PromotionCode__c" : null,
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a1293d48440f69b01845b0d1c64209b",
    "productId" : "2c92a0fb4bb97034014bbbc561fa4fed",
    "productName" : "Supporter",
    "productSku" : "SKU-00000013",
    "productRatePlanId" : "2c92a0f94c547592014c69f5b0ff4f7e",
    "ratePlanName" : "Non Founder Supporter - monthly",
    "ratePlanCharges" : [ {
      "id" : "8a1293d48440f69b01845b0d1c68209d",
      "originalChargeId" : "2c92a0ff583386980158482652065d62",
      "productRatePlanChargeId" : "2c92a0f94c547592014c69f5b1204f80",
      "number" : "C-00373679",
      "name" : "Supporter Membership - Monthly",
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 7,
      "pricingSummary" : "AUD10",
      "priceChangeOption" : "UseLatestProductCatalogPricing",
      "priceIncreasePercentage" : null,
      "currency" : "AUD",
      "price" : 10.000000000,
      "tiers" : null,
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "discountPercentage" : null,
      "discountAmount" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "discountApplyDetails" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "billingPeriod" : "Month",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2016-11-09",
      "effectiveEndDate" : "2023-11-09",
      "processedThroughDate" : "2023-03-09",
      "chargedThroughDate" : "2023-04-09",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "ContractEffective",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.000000000,
      "dmrc" : 0.000000000,
      "tcv" : 840.000000000,
      "dtcv" : 120.000000000,
      "originalOrderDate" : "2016-11-09",
      "amendedByOrderOn" : "2022-11-09",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null
    } ],
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null
  } ],
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2016-11-09",
    "endDate" : "2023-11-09",
    "status" : "Active"
  }, {
    "startDate" : "2023-11-09",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}