lambda/src/test/resources/Migrations/Membership2023/Batch3/USD/subscription.json

{
  "success" : true,
  "id" : "SUBSCRIPTION-ID",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "A00338956",
  "accountName" : "0010J00001kdcV9QAI",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "A00338956",
  "invoiceOwnerAccountName" : "0010J00001kdcV9QAI",
  "subscriptionNumber" : "SUBSCRIPTION-NUMBER",
  "version" : 7,
  "revision" : "7.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2017-01-20",
  "serviceActivationDate" : "2017-01-20",
  "customerAcceptanceDate" : "2017-01-20",
  "subscriptionStartDate" : "2017-01-20",
  "subscriptionEndDate" : "2024-01-20",
  "lastBookingDate" : "2023-01-20",
  "termStartDate" : "2023-01-20",
  "termEndDate" : "2024-01-20",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 5.75,
  "totalContractedValue" : 483.00,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : null,
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : null,
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : null,
  "ActivationDate__c" : null,
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : "US",
  "PromotionCode__c" : null,
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a129a6385cd03d80185cddc4afd1a2d",
    "productId" : "2c92a0fb4bb97034014bbbc561fa4fed",
    "productName" : "Supporter",
    "productSku" : "SKU-00000013",
    "productRatePlanId" : "2c92a0fb4c5481db014c69f4a1e03bbd",
    "ratePlanName" : "Non Founder Supporter - annual",
    "ratePlanCharges" : [ {
      "id" : "8a129a6385cd03d80185cddc4b011a2f",
      "originalChargeId" : "2c92a0fd59b56b850159bc59c32a18ef",
      "productRatePlanChargeId" : "2c92a0fb4c5481db014c69f4a2013bbf",
      "number" : "C-00821076",
      "name" : "Supporter Membership - Annual",
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 7,
      "pricingSummary" : "USD69",
      "priceChangeOption" : "UseLatestProductCatalogPricing",
      "priceIncreasePercentage" : null,
      "currency" : "USD",
      "price" : 69.000000000,
      "tiers" : null,
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "discountPercentage" : null,
      "discountAmount" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "discountApplyDetails" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2017-01-20",
      "effectiveEndDate" : "2024-01-20",
      "processedThroughDate" : "2023-01-20",
      "chargedThroughDate" : "2024-01-20",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "ContractEffective",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 5.750000000,
      "dmrc" : 0.000000000,
      "tcv" : 483.000000000,
      "dtcv" : 69.000000000,
      "originalOrderDate" : "2017-01-20",
      "amendedByOrderOn" : "2023-01-20",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null
    } ],
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null
  } ],
  "orderNumber" : "O-00130049",
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2017-01-20",
    "endDate" : "2024-01-20",
    "status" : "Active"
  }, {
    "startDate" : "2024-01-20",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}